<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a22d04686680a31304ee10ddf3a8567c8c26c2d015472f8c4fbd846e4f39476f","plan_job_ref":"Job Terraform Plan #12 at https://github.com/getsentry/security-cloud-functions-template/actions/runs/13020129135","plan_hash":"a50ac3a3ddaabcfe1e4ae73c13f4d876bb2e65eaf148d28d7529b6d1a790c850","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.workflows.module.workflows["example1"].google_cloudfunctions_function_iam_member._["example-gen1"] will be created
  + resource "google_cloudfunctions_function_iam_member" "_" {
      + cloud_function = "example-gen1"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.workflows.module.workflows["example1"].google_cloudfunctions_function_iam_member._["example-gen2"] will be created
  + resource "google_cloudfunctions_function_iam_member" "_" {
      + cloud_function = "example-gen2"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.workflows.module.workflows["example1"].google_service_account.workflow_sa will be created
  + resource "google_service_account" "workflow_sa" {
      + account_id   = "***********"
      + disabled     = false
      + display_name = "Workflow Service Account for example1"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "jeffreyhung-test"
      + unique_id    = (known after apply)
    }

  # module.workflows.module.workflows["example1"].google_service_account_iam_member.deploy_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "deploy_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:gha-cloud-functions-deployment@sec-dnr-infra.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.workflows.module.workflows["example1"].google_service_account_iam_member.workflow_sa_actas_iam will be created
  + resource "google_service_account_iam_member" "workflow_sa_actas_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.workflows.module.workflows["example1"].google_workflows_workflow.workflow will be created
  + resource "google_workflows_workflow" "workflow" {
      + create_time      = (known after apply)
      + description      = "example workflow"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + name             = "example1"
      + name_prefix      = (known after apply)
      + project          = "jeffreyhung-test"
      + revision_id      = (known after apply)
      + service_account  = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform Apply #10](https://github.com/getsentry/security-cloud-functions-template/actions/runs/13020144573)